DataProcessors/ВыгрузкаНСИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>ВыгрузкаНСИ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/РезультатыВыполненияОбработок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>РезультатыВыполненияОбработок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Успешный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СообщенияОбОшибках</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>256</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ВыгрузкаНСИ/Ext/ManagerModule.bsl
Процедура ВыгрузитьДанные() Экспорт 
	
	//ВыгрузитьВБазу("OrdersChees",	"MLK",Истина);	
	ВыгрузитьВБазу("Work_GreenStep","GrSt",Истина);	
	ВыгрузитьВБазу("Work_Buh_UU",	"UUB",Истина);	
	ВыгрузитьВБазу("Buh",			"BUH",Ложь);	
	ВыгрузитьВБазу("DocumentOborot","DOC",Истина);	
	
КонецПроцедуры

Процедура УстановитьУзелОбменаУСтрокДерева(Дерево, УзелОбмена)
	
	Для Каждого Строка Из Дерево Цикл
		Если Строка.ЭтоГруппа Тогда
			УстановитьУзелОбменаУСтрокДерева(Строка.Строки, УзелОбмена);
		Иначе
			Строка.СсылкаНаУзелОбмена = УзелОбмена;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СформироватьПакетДанных(ПравилаОбмена, УзелОбмена, СтатусВыгрузки, Выгружено, Ошибки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);	
	
	
	ЧтениеХМЛ = Новый ЧтениеXML;
	
	ЧтениеХМЛ.УстановитьСтроку(ПравилаОбмена.Получить());
	ЧтениеХМЛ.Прочитать();
	
	Обмен = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	
	ФайлПротокола = ПолучитьИмяВременногоФайла(".txt");
	Обмен.ИмяФайлаПротоколаОбмена = ФайлПротокола;
	
	Обмен.РежимОбмена = "Выгрузка";
	ИмяВремФайла = ПолучитьИмяВременногоФайла("xml");
	Обмен.ИмяФайлаОбмена = ИмяВремФайла;
	Обмен.ИмяФайлаПравилОбмена ="ЧтениеXML";	
	Обмен.ЗагрузитьПравилаОбмена(ЧтениеХМЛ,"ЧтениеXML");
	
	//УстановитьУзелОбменаУСтрокДерева(Обмен.ТаблицаПравилВыгрузки.Строки,УзелОбмена);
	
	Обмен.ЗагружатьДанныеВРежимеОбмена = Истина;
	Обмен.ЗаписыватьРегистрыНаборамиЗаписей = Истина;
	Обмен.ТипУдаленияРегистрацииИзмененийДляУзловОбменаПослеВыгрузки = 0;
	
	Если УзелОбмена.Код = "UUB" Тогда
		Обмен.УстановитьЗначениеПараметраВТаблице("Получатель", УзелОбмена);
	ИначеЕсли УзелОбмена.Код = "BUH" Тогда
		Обмен.УстановитьЗначениеПараметраВТаблице("УзелНСИ", УзелОбмена);	
	КонецЕсли;
	
	Обмен.ВыполнитьВыгрузку();
	
	/// читаем логи
	ЧтениеТекстаПротокола = Новый ЧтениеТекста;
	ЧтениеТекстаПротокола.Открыть(ФайлПротокола, КодировкаТекста.Системная);
	ТекстПротокола = ЧтениеТекстаПротокола.Прочитать();
	
	ВсеОк = Истина;
	Для ст = 1 По СтрЧислоСтрок(ТекстПротокола) Цикл 
		тст  = СтрПолучитьСтроку(ТекстПротокола,ст);
		Если  СтрНайти(тст,"Выгружено объектов:") > 0 Тогда
			Попытка
				Выгружено = Число(СокрЛП(СтрЗаменить(тст,"Выгружено объектов:","")));
			Исключение
			КонецПопытки;
		ИначеЕсли СтрНайти(ВРег(тст),ВРег("Ошибка"))> 0 Тогда
			ВсеОк = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Ошибки = ТекстПротокола;
	СтатусВыгрузки = ВсеОк;	
	ЧтениеТекстаПротокола.Закрыть();
	УдалитьФайлы(ФайлПротокола);
	
	///Результат выгрузки данных
	ЧтениеТекста = Новый ЧтениеТекста;
	ЧтениеТекста.Открыть(ИмяВремФайла, КодировкаТекста.UTF8);
	Результат = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	УдалитьФайлы(ИмяВремФайла);
	
	ХранилищеДанных = Новый ХранилищеЗначения(Результат, Новый СжатиеДанных(9));
	
	Возврат ХранилищеДанных;
	
КонецФункции

Процедура УдалитьРегистрацию(УзелОбмена) Экспорт 
	
	ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, 1);
	
	Для Каждого Состав Из УзелОбмена.Метаданные().Состав Цикл
		Если УзелОбмена.Код = "MLK" Тогда
			Если Состав.Метаданные <> Метаданные.Справочники.ДоговорыКонтрагентов Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Состав.Метаданные);
			КонецЕсли;
		ИначеЕсли УзелОбмена.Код = "DOC" Тогда
			Если Состав.Метаданные <> Метаданные.Справочники.Контрагенты И Состав.Метаданные <> Метаданные.Справочники.Организации Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Состав.Метаданные);
			КонецЕсли;
		ИначеЕсли УзелОбмена.Код = "UUB" Тогда
			Если Состав.Метаданные = Метаданные.Справочники.Организации Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Состав.Метаданные);
			КонецЕсли;
		ИначеЕсли УзелОбмена.Код = "BUH" Тогда
			Если Состав.Метаданные = Метаданные.Справочники.Организации ИЛИ Состав.Метаданные = Метаданные.Справочники.КассыКомпании Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Состав.Метаданные);
			КонецЕсли;
		Иначе
			Если Состав.Метаданные = Метаданные.Справочники.Организации ИЛИ Состав.Метаданные = Метаданные.Справочники.КассыКомпании ИЛИ Состав.Метаданные = Метаданные.Справочники.БанковскиеСчетаОрганизаций Тогда
				ПланыОбмена.УдалитьРегистрациюИзменений(УзелОбмена, Состав.Метаданные);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверимПротоколОбмена(Результат,Ошибки)
	//Проверим протокол обмена
	ТекстПротокола = Результат.Description;
	ВсеОк = Истина;
	Загружено = 0;
	Для ст = 1 По СтрЧислоСтрок(ТекстПротокола) Цикл 
		тст  = СтрПолучитьСтроку(ТекстПротокола,ст);
		Если  Найти(тст,"Загружено объектов:") > 0 Тогда
			Попытка
				Загружено = Число(СокрЛП(СтрЗаменить(тст,"Загружено объектов:","")));
			Исключение
			КонецПопытки;
		ИначеЕсли Найти(ВРег(тст),ВРег("Ошибка"))> 0 Тогда
			ВсеОк = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Результат = Загружено;
КонецПроцедуры

Процедура ВыгрузитьВБазу(КлючОбработки,КодУзла,Login) Экспорт 
	
	ИдентификаторОбработки = "ВыгрузкаНСИ";		
	
	СтруктураЗаписиЖурнала = РегистрыСведений.РезультатыВыполненияОбработок.СформироватьСтруктуруЗаписиРезультатов();
	СтруктураЗаписиЖурнала.ИдентификаторОбработки = ИдентификаторОбработки;
	СтруктураЗаписиЖурнала.КлючОбработки = КлючОбработки;
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Начало обработки.", СтруктураЗаписиЖурнала);
	
	Попытка
		Если Login Тогда
			Пользователь = "ObmenSSL";
			Пароль = "bynthghbpf";	
			Определение = Новый WSОпределения("https://orders-1c.digma.ua/"+КлючОбработки+"/ws/cwd2.1cws?wsdl",Пользователь,Пароль,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
			WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
			WS.Пользователь = Пользователь;
			WS.Пароль = Пароль;
		Иначе
			Определение = Новый WSОпределения("https://orders-1c.digma.ua/"+КлючОбработки+"/cwd2.1cws?wsdl",,,,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));	
			WS = Новый WSПрокси(Определение,"http://www.digma.ua", "CommunicationWithDatabases", "CommunicationWithDatabasesSoap",,,Новый ЗащищенноеСоединениеOpenSSL(Неопределено,Неопределено));
		КонецЕсли;
		
		
	Исключение 
		ОшибкиИнициализации = ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
		
		КодСостояния = "ОбработкаОбмена.ИнициализацияОбработки - Не удалось подключится к базе: " + КлючОбработки;						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния	"+КодСостояния, СтруктураЗаписиЖурнала);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание		"+ОшибкиИнициализации, СтруктураЗаписиЖурнала);												
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
		
		Возврат;
	КонецПопытки;
	
	ПравилаОбмена	= ПолучитьМакет("Правило_"+КлючОбработки).ПолучитьТекст();
	ХранилищеДанных	= Новый ХранилищеЗначения(ПравилаОбмена, Новый СжатиеДанных(9));	
	УзелОбмена		= ПланыОбмена.ОбменНСИ.НайтиПоКоду(КодУзла);
	СтатусВыгрузки	= Ложь;
	Ошибки			= "";
	Выгружено		= 0;
	
	Попытка
		ДанныеОбмена = СформироватьПакетДанных(ХранилищеДанных, УзелОбмена, СтатусВыгрузки, Выгружено, Ошибки);
	Исключение 
		ОшибкиИнициализации = ОписаниеОшибки();
		
		ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
		
		КодСостояния = "ОбработкаОбмена.ФормированиеПакетаДанных - Не удалось выгрузить данные";						
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния	"+КодСостояния, СтруктураЗаписиЖурнала);
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание		"+ОшибкиИнициализации, СтруктураЗаписиЖурнала);												
		РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
		
		//Возврат;
	КонецПопытки;
	
	Если СтатусВыгрузки Тогда
		РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий(Ошибки, СтруктураЗаписиЖурнала);
		Если Выгружено Тогда
			Ошибки = "";
			Попытка
				Если УзелОбмена.Код = "BUH" Тогда
					ОтветУпрДок = WS.DownloadUO(ДанныеОбмена);
					ПроверимПротоколОбмена(ОтветУпрДок,Ошибки)
				Иначе
					ОтветУпрДок = WS.ЗагрузитьПоПравилам(ДанныеОбмена,Ошибки);
				КонецЕсли;
				Если ОтветУпрДок Тогда
					УдалитьРегистрацию(УзелОбмена);
					РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Загружено объектов:  "+ОтветУпрДок, СтруктураЗаписиЖурнала);
					РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Окончание обработки.", СтруктураЗаписиЖурнала);
				Иначе
					РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(Ошибки, СтруктураЗаписиЖурнала);												
				КонецЕсли;
				РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, ОтветУпрДок);
			Исключение 
				ОшибкиИнициализации = ОписаниеОшибки();
				
				ОбщегоНазначения.СообщитьПользователю(ОшибкиИнициализации);
				
				КодСостояния = "ОбработкаОбмена.ЗагрузкаДокументов - Не удалось загрузить данные";						
				РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("КодСостояния "+КодСостояния, СтруктураЗаписиЖурнала);
				РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке("Описание "+ОшибкиИнициализации, СтруктураЗаписиЖурнала);												
				РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, Ложь);
				
				Возврат;
			КонецПопытки;
		Иначе
			УдалитьРегистрацию(УзелОбмена);
		КонецЕсли;
	Иначе
		РегистрыСведений.РезультатыВыполненияОбработок.СообщитьОбОшибке(Ошибки, СтруктураЗаписиЖурнала);												
	КонецЕсли;
	
	РегистрыСведений.РезультатыВыполненияОбработок.ДобавитьКомментарий("Окончание обработки.", СтруктураЗаписиЖурнала);
	РегистрыСведений.РезультатыВыполненияОбработок.ЗафиксироватьРезультатЖурналеВыполненияОбработок(СтруктураЗаписиЖурнала, СтатусВыгрузки);
	
КонецПроцедуры
